title: Process Manipulation via Syscall
id: 550e8400-e29b-41d4-a716-556655462001
status: stable
description: >
  Détecte des appels système suspects pour manipuler des processus.
author: hala-hamza
date: 2026/04/27
logsource:
  product: linux
  service: auditd
detection:
  selection:
    event.dataset: "auditd.log"
    message|contains: "SYSCALL"
  keywords:
    message|contains:
      - "kill -9"
      - "kill -SIGKILL"
      - "pkill -9"
      - "killall -9"
  suspicious_targets:
    message|contains:
      - "auditd"
      - "sshd"
      - "rsyslog"
      - "filebeat"
  condition: selection and keywords and suspicious_targets
level: critical
tags:
  - attack.defense_evasion
  - attack.T1562.001
falsepositives:
  - Aucun
