title: Execution from Suspicious Folder
id: 550e8400-e29b-41d4-a716-446655441002
status: stable
description: Détecte l'exécution depuis des dossiers suspects (tmp, www, mysql)
author: SigmaHQ
date: 2026/04/27
logsource:
  product: linux
  service: auditd
detection:
  selection:
    event.dataset: "auditd.log"
    message|contains: "SYSCALL"
  keywords:
    message|contains:
      - "/tmp/"
      - "/var/www/"
      - "/var/lib/mysql/"
      - "/dev/shm/"
  condition: selection and keywords
level: high
tags:
  - attack.execution
  - attack.T1059
  - attack.defense_evasion
  - attack.T1036
falsepositives:
  - Scripts légitimes dans /tmp
