title: Crontab Command Execution
id: 550e8400-e29b-41d4-a716-556655460007
status: stable
description: >
  Détecte l'utilisation de la commande crontab pour planifier des tâches.
  Technique de persistence courante.
author: hala-hamza
date: 2026/04/27
logsource:
  product: linux
  service: auditd
detection:
  selection:
    event.dataset: "auditd.log"
    message|contains: "EXECVE"
  keywords:
    message|contains:
      - "crontab -e"
      - "crontab -l"
      - "crontab -u"
  condition: selection and keywords
level: medium
tags:
  - attack.persistence
  - attack.T1053.003
falsepositives:
  - Planification légitime
