title: PATH Variable Manipulation
id: 550e8400-e29b-41d4-a716-556655460012
status: stable
description: >
  Détecte la manipulation de la variable PATH pour détourner des commandes.
author: hala-hamza
date: 2026/04/27
logsource:
  product: linux
  service: auditd
detection:
  selection:
    event.dataset: "auditd.log"
    message|contains: "EXECVE"
  keywords:
    message|contains:
      - "export PATH="
      - "PATH=/tmp"
      - "PATH=.:"
  condition: selection and keywords
level: high
tags:
  - attack.defense_evasion
  - attack.T1574.007
falsepositives:
  - Configuration d'environnement légitime
