title: ASLR Protection Disabled
id: 550e8400-e29b-41d4-a716-556655449002
status: stable
description: Désactivation de la protection ASLR - facilite les exploits
author: hala-hamza
date: 2026/04/27
logsource:
  product: linux
  service: auditd
detection:
  selection:
    event.dataset: "auditd.log"
  keywords:
    message|contains:
      - "randomize_va_space"
      - "kernel.randomize_va_space=0"
  condition: selection and keywords
level: high
tags:
  - attack.defense_evasion
  - attack.T1562
falsepositives:
  - Tests de développement