title: Backup Service Stopped
id: 550e8400-e29b-41d4-a716-556655452002
status: stable
description: >
  Détecte l'arrêt de services de backup avant ransomware potentiel.
author: hala-hamza
date: 2026/04/27
logsource:
  product: linux
  service: auditd
detection:
  selection:
    event.dataset: "auditd.log"
    message|contains: "SERVICE_STOP"
  keywords:
    message|contains:
      - "bacula"
      - "amanda"
      - "rsnapshot"
      - "borgbackup"
      - "duplicati"
  condition: selection and keywords
level: high
tags:
  - attack.impact
  - attack.T1490
falsepositives:
  - Maintenance de backup
