title: Crontab Modification
id: 550e8400-e29b-41d4-a716-556655444002
status: stable
description: Modification des crontabs - persistence potentielle
author: hala-hamza
date: 2026/04/27
logsource:
  product: linux
  service: auditd
detection:
  selection:
    event.dataset: "auditd.log"
    message|contains: "PATH"
  keywords:
    message|contains:
      - "/etc/crontab"
      - "/etc/cron.d/"
      - "/var/spool/cron/"
  condition: selection and keywords
level: high
tags:
  - attack.persistence
  - attack.T1053.003
falsepositives:
  - Planification de tâches légitime
