title: SSH Authorized Keys Modification
id: 550e8400-e29b-41d4-a716-556655444001
status: stable
description: Modification des clés SSH autorisées - persistence
author: hala-hamza
date: 2026/04/27
logsource:
  product: linux
  service: auditd
detection:
  selection:
    event.dataset: "auditd.log"
    message|contains: "PATH"
  keywords:
    message|contains:
      - "authorized_keys"
      - ".ssh/authorized_keys"
  condition: selection and keywords
level: critical
tags:
  - attack.persistence
  - attack.T1098.004
falsepositives:
  - Gestion légitime des clés SSH
